package 어두운밤;

import java.util.Random;

public class 주민 {
	public String 직업 = "백수";
	int 나이 = 0; // 0이면 어른, 1이면 아이
	String 건강 = "양호"; 
	String 작업능률 = "";
	String 도구 = "맨손";
	int 직업숙련도;
	String 성별 = "";
	int 직업숙련도증가량 = 1;
	boolean 생존여부 = true;
	int 건강수치 = 100;
	int 작업능률수치 = 0;
	boolean 성인여부 = false;
	String 성인여부1 = "";
	int 포만감 = 0;

	Random 무작위 = new Random();
	String 이름;
	int 성별랜덤 = 무작위.nextInt(2);
	int 성씨랜덤 = 무작위.nextInt(49);
	int 이름랜덤 = 무작위.nextInt(101);
	int 직업번호 = 0;
	String 직업타이틀 = "";
	int[] 직업숙련도배열 = new int[10];

	public 주민() {

		if (this.성별랜덤 == 0) {
			this.성별 = "남자";
		} else {
			this.성별 = "여자";
		}

		if (this.건강수치 <= 20) {
			this.건강 = "매우 좋지않음";
		} else if (this.건강수치 > 20 && this.건강수치 <= 50) {
			this.건강 = "좋지않음";
		} else if (this.건강수치 > 50 && this.건강수치 <= 60) {
			this.건강 = "보통";
		} else if (this.건강수치 > 60 && this.건강수치 <= 90) {
			this.건강 = "양호";
		} else if (this.건강수치 > 90 && this.건강수치 <= 100) {
			this.건강 = "매우 양호";
		}
		this.작업능률수치 = this.직업숙련도/3;
		if (this.작업능률수치 >= 0 && this.작업능률수치 <= 20) {
			this.작업능률 = "최하";
		} else if (this.작업능률수치 > 20 && this.작업능률수치 <= 40) {
			this.작업능률 = "하";
		} else if (this.작업능률수치 > 40 && this.작업능률수치 <= 60) {
			this.작업능률 = "보통";
		} else if (this.작업능률수치 > 60 && this.작업능률수치 <= 80) {
			this.작업능률 = "상";
		} else if (this.작업능률수치 > 80 && this.작업능률수치 <= 100){
			this.작업능률 = "최상";
		}
		if (this.작업능률수치 >= 0 && this.작업능률수치 <= 20) {
			this.작업능률 = "최하";
		} else if (this.작업능률수치 > 20 && this.작업능률수치 <= 40) {
			this.작업능률 = "하";
		} else if (this.작업능률수치 > 40 && this.작업능률수치 <= 60) {
			this.작업능률 = "보통";
		} else if (this.작업능률수치 > 60 && this.작업능률수치 <= 80) {
			this.작업능률 = "상";
		} else if (this.작업능률수치 > 80 && this.작업능률수치 <= 100){
			this.작업능률 = "최상";
		}

		String[] 남자이름 = new String[101];
		남자이름[0] = "서준";
		남자이름[1] = "하준";
		남자이름[2] = "시우";
		남자이름[3] = "도윤";
		남자이름[4] = "예준";
		남자이름[5] = "주원";
		남자이름[6] = "민준";
		남자이름[7] = "지호";
		남자이름[8] = "도현";
		남자이름[9] = "유준";
		남자이름[10] = "건우";
		남자이름[11] = "선우";
		남자이름[12] = "서진";
		남자이름[13] = "시윤";
		남자이름[14] = "지후";
		남자이름[15] = "은우";
		남자이름[16] = "지안";
		남자이름[17] = "준우";
		남자이름[18] = "윤우";
		남자이름[19] = "우진";
		남자이름[20] = "연우";
		남자이름[21] = "현우";
		남자이름[22] = "지훈";
		남자이름[23] = "이준";
		남자이름[24] = "준서";
		남자이름[25] = "승우";
		남자이름[26] = "지한";
		남자이름[27] = "정우";
		남자이름[28] = "이안";
		남자이름[29] = "지환";
		남자이름[30] = "수호";
		남자이름[31] = "지우";
		남자이름[32] = "시현";
		남자이름[33] = "시후";
		남자이름[34] = "시온";
		남자이름[35] = "민재";
		남자이름[36] = "현준";
		남자이름[37] = "도경";
		남자이름[38] = "진우";
		남자이름[39] = "은호";
		남자이름[40] = "수현";
		남자이름[41] = "시안";
		남자이름[42] = "하진";
		남자이름[43] = "시원";
		남자이름[44] = "승현";
		남자이름[45] = "재윤";
		남자이름[46] = "윤재";
		남자이름[47] = "다온";
		남자이름[48] = "주안";
		남자이름[49] = "지원";
		남자이름[50] = "하민";
		남자이름[51] = "율";
		남자이름[52] = "하람";
		남자이름[53] = "준혁";
		남자이름[54] = "도율";
		남자이름[55] = "유찬";
		남자이름[56] = "로운";
		남자이름[57] = "서우";
		남자이름[58] = "라온";
		남자이름[59] = "서후";
		남자이름[60] = "태양";
		남자이름[61] = "한결";
		남자이름[62] = "태윤";
		남자이름[63] = "재현";
		남자이름[64] = "민호";
		남자이름[65] = "서율";
		남자이름[66] = "재하";
		남자이름[67] = "시완";
		남자이름[68] = "하율";
		남자이름[69] = "지율";
		남자이름[70] = "우주";
		남자이름[71] = "지완";
		남자이름[72] = "우빈";
		남자이름[73] = "지성";
		남자이름[74] = "준영";
		남자이름[75] = "승민";
		남자이름[76] = "윤호";
		남자이름[77] = "시훈";
		남자이름[78] = "민우";
		남자이름[79] = "시환";
		남자이름[80] = "준";
		남자이름[81] = "하랑";
		남자이름[82] = "예성";
		남자이름[83] = "주호";
		남자이름[84] = "지오";
		남자이름[85] = "재민";
		남자이름[86] = "승재";
		남자이름[87] = "은찬";
		남자이름[88] = "시율";
		남자이름[89] = "도원";
		남자이름[90] = "가온";
		남자이름[91] = "이현";
		남자이름[92] = "윤";
		남자이름[93] = "태준";
		남자이름[94] = "민규";
		남자이름[95] = "현서";
		남자이름[96] = "민성";
		남자이름[97] = "지혁";
		남자이름[98] = "성준";
		남자이름[99] = "태현";
		남자이름[100] = "종호";

		String[] 여자이름 = new String[101];
		여자이름[0] = "지아";
		여자이름[1] = "하윤";
		여자이름[2] = "지유";
		여자이름[3] = "서아";
		여자이름[4] = "서윤";
		여자이름[5] = "수아";
		여자이름[6] = "지우";
		여자이름[7] = "하린";
		여자이름[8] = "하은";
		여자이름[9] = "서연";
		여자이름[10] = "다은";
		여자이름[11] = "서현";
		여자이름[12] = "소율";
		여자이름[13] = "채아";
		여자이름[14] = "채원";
		여자이름[15] = "예린";
		여자이름[16] = "서우";
		여자이름[17] = "아린";
		여자이름[18] = "유나";
		여자이름[19] = "윤서";
		여자이름[20] = "예나";
		여자이름[21] = "시은";
		여자이름[22] = "유주";
		여자이름[23] = "하율";
		여자이름[24] = "아인";
		여자이름[25] = "소윤";
		여자이름[26] = "민서";
		여자이름[27] = "아윤";
		여자이름[28] = "은서";
		여자이름[29] = "하연";
		여자이름[30] = "예은";
		여자이름[31] = "채은";
		여자이름[32] = "다인";
		여자이름[33] = "주아";
		여자이름[34] = "윤아";
		여자이름[35] = "지윤";
		여자이름[36] = "서하";
		여자이름[37] = "서율";
		여자이름[38] = "연서";
		여자이름[39] = "다온";
		여자이름[40] = "예원";
		여자이름[41] = "서은";
		여자이름[42] = "채윤";
		여자이름[43] = "나은";
		여자이름[44] = "지원";
		여자이름[45] = "수빈";
		여자이름[46] = "사랑";
		여자이름[47] = "세아";
		여자이름[48] = "다윤";
		여자이름[49] = "다현";
		여자이름[50] = "가은";
		여자이름[51] = "연우";
		여자이름[52] = "예서";
		여자이름[53] = "지율";
		여자이름[54] = "소민";
		여자이름[55] = "재이";
		여자이름[56] = "시연";
		여자이름[57] = "나윤";
		여자이름[58] = "설아";
		여자이름[59] = "유하";
		여자이름[60] = "유진";
		여자이름[61] = "지민";
		여자이름[62] = "예진";
		여자이름[63] = "은채";
		여자이름[64] = "서진";
		여자이름[65] = "다연";
		여자이름[66] = "시현";
		여자이름[67] = "설";
		여자이름[68] = "예지";
		여자이름[69] = "소이";
		여자이름[70] = "나연";
		여자이름[71] = "유빈";
		여자이름[72] = "아현";
		여자이름[73] = "지온";
		여자이름[74] = "아진";
		여자이름[75] = "주하";
		여자이름[76] = "서희";
		여자이름[77] = "연아";
		여자이름[78] = "소은";
		여자이름[79] = "라온";
		여자이름[80] = "리아";
		여자이름[81] = "채이";
		여자이름[82] = "수현";
		여자이름[83] = "라희";
		여자이름[84] = "채린";
		여자이름[85] = "규리";
		여자이름[86] = "은유";
		여자이름[87] = "수연";
		여자이름[88] = "도연";
		여자이름[89] = "예빈";
		여자이름[90] = "시온";
		여자이름[91] = "하영";
		여자이름[92] = "아영";
		여자이름[93] = "루아";
		여자이름[94] = "서영";
		여자이름[95] = "다솜";
		여자이름[96] = "봄";
		여자이름[97] = "하진";
		여자이름[98] = "지효";
		여자이름[99] = "한빛";
		여자이름[100] = "도화";

		String[] 성씨 = new String[49];
		성씨[0] = "김";
		성씨[1] = "이";
		성씨[2] = "박";
		성씨[3] = "최";
		성씨[4] = "정";
		성씨[5] = "강";
		성씨[6] = "조";
		성씨[7] = "윤";
		성씨[8] = "장";
		성씨[9] = "임";
		성씨[10] = "오";
		성씨[11] = "한";
		성씨[12] = "신";
		성씨[13] = "서";
		성씨[14] = "권";
		성씨[15] = "황";
		성씨[16] = "안";
		성씨[17] = "송";
		성씨[18] = "류";
		성씨[19] = "홍";
		성씨[20] = "전";
		성씨[21] = "고";
		성씨[22] = "문";
		성씨[23] = "손";
		성씨[24] = "양";
		성씨[25] = "배";
		성씨[26] = "백";
		성씨[27] = "조";
		성씨[28] = "허";
		성씨[29] = "남";
		성씨[30] = "심";
		성씨[31] = "유";
		성씨[32] = "노";
		성씨[33] = "하";
		성씨[34] = "전";
		성씨[35] = "곽";
		성씨[36] = "성";
		성씨[37] = "차";
		성씨[38] = "유";
		성씨[39] = "구";
		성씨[40] = "우";
		성씨[41] = "주";
		성씨[42] = "임";
		성씨[43] = "나";
		성씨[44] = "신";
		성씨[45] = "민";
		성씨[46] = "진";
		성씨[47] = "지";
		성씨[48] = "엄";

		// 이름합치기
		this.이름 = 성씨[성씨랜덤];

		if (this.성별 == "남자") {
			this.이름 = this.이름 + 남자이름[이름랜덤];
		} else {
			this.이름 = this.이름 + 여자이름[이름랜덤];
		}
		String[] 직업군 = new String[10];
		직업군[0] = "백수";
		직업군[1] = "나무꾼";
		직업군[2] = "사냥꾼";
		직업군[3] = "건춘가";
		직업군[4] = "대장장이";
		직업군[5] = "농부";
		직업군[6] = "목동";
		직업군[7] = "재단사";
		직업군[8] = "약초상";
		직업군[9] = "채굴꾼";

		this.직업 = 직업군[직업번호];

		직업숙련도배열[0] = 0; // 백수;
		직업숙련도배열[1] = 0;// 나무꾼 - 나무
		직업숙련도배열[2] = 0;// 사냥꾼 - 사슴고기, 모피
		직업숙련도배열[3] = 0;// 건축가 - 건설
		직업숙련도배열[4] = 0;// 대장장이 - 도구제작
		직업숙련도배열[5] = 0;// 농부 - 감자, 옥수수, 밀 (씨앗구매 )
		직업숙련도배열[6] = 0;// 목동 - 양, 소,
		직업숙련도배열[7] = 0;// 재단사 - 가죽, 원단 - 의류생산
		직업숙련도배열[8] = 0;// 약초상 - 허브 - 주민 건강수치 올림
		직업숙련도배열[9] = 0;// 채굴꾼 - 석재, 철

		// 직업인덱스에 따른 마을 직업 통계 변화
		switch (this.직업번호) {
		case 0:
			직업숙련도배열[0] = this.직업숙련도;
//				마을.백수++;
			break;
		case 1:
			직업숙련도배열[1] = this.직업숙련도;
//				마을.나무꾼++;
			break;
		case 2:
			직업숙련도배열[2] = this.직업숙련도;
//				마을.사냥꾼++;
			break;
		case 3:
			직업숙련도배열[3] = this.직업숙련도;
//				마을.건축가++;
			break;
		case 4:
			직업숙련도배열[4] = this.직업숙련도;
//				마을.대장장이++;
			break;
		case 5:
			직업숙련도배열[5] = this.직업숙련도;
//				마을.농부++;
			break;
		case 6:
			직업숙련도배열[6] = this.직업숙련도;
//				마을.목동++;
			break;
		case 7:
			직업숙련도배열[7] = this.직업숙련도;
//				마을.재단사++;
			break;
		case 8:
			직업숙련도배열[8] = this.직업숙련도;
//				마을.약초상++;
			break;
		case 9:
			직업숙련도배열[9] = this.직업숙련도;
//				마을.채굴꾼++;
			break;
		}

		if (this.직업숙련도 >= 0 && this.직업숙련도 <= 10) {
			this.직업타이틀 = "수습";
		} else if (this.직업숙련도 > 10 && this.직업숙련도 <= 30) {
			this.직업타이틀 = "초급";
		} else if (this.직업숙련도 > 30 && this.직업숙련도 <= 60) {
			this.직업타이틀 = "중급";
		} else if (this.직업숙련도 > 60 && this.직업숙련도 <= 90) {
			this.직업타이틀 = "고급";
		} else if (this.직업숙련도 > 90 && this.직업숙련도 <= 100) {
			this.직업타이틀 = "장인";
		}
		// 어린이 일경우 직업 : 없음
		if (this.나이 <= 3) {
			this.직업 = "없음";
			this.성인여부1 = "갓난아기";
			this.직업타이틀 = "";
			this.직업숙련도 = 0;
		} else if (this.나이 > 3 && this.나이 <= 14) {
			this.직업 = "없음";
			this.성인여부1 = "어린이";
			this.직업타이틀 = "";
			this.직업숙련도 = 0;
		} else if (this.나이 > 14 && this.나이 <= 17) {
			this.직업 = "없음";
			this.성인여부1 = "청소년";
			this.직업타이틀 = "";
			this.직업숙련도 = 0;
		} else if (this.나이 > 17 && this.나이 <= 100) {
			this.성인여부 = true;
			this.성인여부1 = "어른";
		}

	}

	public void 작업을_하다() {

		switch (this.직업번호) {
		case 0:
			this.직업숙련도 = 직업숙련도배열[0];

			break;
		case 1:
			this.직업숙련도 = 직업숙련도배열[1];
			break;
		case 2:
			this.직업숙련도 = 직업숙련도배열[2];
			break;
		case 3:
			this.직업숙련도 = 직업숙련도배열[3];
			break;
		case 4:
			this.직업숙련도 = 직업숙련도배열[4];
			break;
		case 5:
			this.직업숙련도 = 직업숙련도배열[5];
			break;
		case 6:
			this.직업숙련도 = 직업숙련도배열[6];
			break;
		case 7:
			this.직업숙련도 = 직업숙련도배열[7];
			break;
		case 8:
			this.직업숙련도 = 직업숙련도배열[8];
			break;
		case 9:
			this.직업숙련도 = 직업숙련도배열[9];
			break;
		}
		this.직업숙련도 += this.직업숙련도증가량;
		if (this.나이 > 16) {
			System.out.println(this.직업타이틀 + " " + this.직업 + " " + this.이름 + " 일을 하고 있다.	\n");
			System.out.println(this.직업 + " 직업 숙련도 가 " + 직업숙련도증가량 + " 증가하였다.\n");
			System.out.println("현재 " + this.이름 + "의 " + this.직업 + " 직업숙련도: " + 직업숙련도 + "\n");
		} else {
			System.out.println(this.이름 + " 아직 나이가 어려 일을 할 수 없다.\n");
		}

	}

	public void 정보를_확인하다() {

		if (this.건강수치 <= 20) {
			this.건강 = "매우 좋지않음";
		} else if (this.건강수치 > 20 && this.건강수치 <= 50) {
			this.건강 = "좋지않음";
		} else if (this.건강수치 > 50 && this.건강수치 <= 60) {
			this.건강 = "보통";
		} else if (this.건강수치 > 60 && this.건강수치 <= 90) {
			this.건강 = "양호";
		} else if (this.건강수치 > 90 && this.건강수치 <= 100) {
			this.건강 = "매우 양호";
		}
		System.out.println("======================================");
		System.out.println("주민 " + this.이름 + " 의 개인정보");
		System.out.println("이름: " + this.이름);
		System.out.println("성별: " + this.성별);
		System.out.println("나이: " + this.나이 + "세 / " + this.성인여부1);
		System.out.println("건강: " + this.건강 + "(수치:" + this.건강수치 + ")");
		if(this.성인여부 == true) {
			System.out.println("직업: " + this.직업타이틀 + " " + this.직업 + " (직업숙련도: " + this.직업숙련도+")");
			System.out.println("작업능률: " + this.작업능률+ "(수치:" + this.작업능률수치 + ")");
			System.out.println("도구: " + this.도구);
		} else if(this.직업 == "백수") {
			System.out.println("직업: " + this.직업타이틀 + " " + this.직업);
		}		
		System.out.println("======================================");
	}

	public void 나이를_먹는다() {
		this.나이++;
		if (this.나이 > 17) {
			System.out.println("아이 한명이 나이를 먹어 어른이 되었다.");
			System.out.println("주민 " + this.이름 + "이 어른이 되어 이제 일을 할수 있습니다. \n");
		}
	}

	public void 죽다(int 죽는사람인덱스) {
		// 온도가 낮으면
		
		
		// 배고픔이 낮으면
		
		
//		this.생존여부 = false;
//		마을.주민들.remove(죽은사람인덱스);
//		System.out.println("주민 "+ 마을.주민들.get(죽는사람인덱스) + " 한명이 죽었다.	\n");
	}

	public void 출산을_하다() {
		마을.인구수++;
		System.out.println("아이의 울음소리가 들린다.	\n");
		System.out.println("인구가 1 증가 하였습니다.	\n");
		System.out.println("현재 인구수 : " + 마을.인구수 + "\n");
	}

	public void 마을을_떠나다() {
		마을.인구수--;
		System.out.println(this.직업 + " 한명이 마을을 떠난다.\n");
		System.out.println("인구가 1 감소 하였습니다.	\n");
		System.out.println("현재 인구수 : " + 마을.인구수 + "\n");
	}

}
